DataProcessors/ПереносСборников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ПереносСборников</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/СложностиСборников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СложностиСборников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ШестьОтветов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧетыреОтвета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Сборники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Сборники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сложность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СложностиСборников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСборника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаСборника</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БратьОтветыИзТекущегоСборника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Задания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Задания</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Сборники</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстВопросаЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаЗадания</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтветыЗаданий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТекстОтвета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Правильность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ПереносСборников/Ext/ManagerModule.bsl
// Возвращает парсер xml, инициализированный из файла с путём ПутьКФайлуВход,
// либо строкой СтрокаXmlВход. Когда данные не заданы, возвращает Неопределено.
Функция ОткрытьПарсер(ПутьКФайлуВход = "", СтрокаXmlВход = "") Экспорт
	РезультатФункции = Новый ЧтениеXML;
	Если СокрЛП(ПутьКФайлуВход) <> "" Тогда
		РезультатФункции.ОткрытьФайл(ПутьКФайлуВход);
	ИначеЕсли СокрЛП(СтрокаXmlВход) <> "" Тогда
		Если ТипЗнч(СтрокаXmlВход) = Тип("Строка") Тогда
			РезультатФункции.УстановитьСтроку(СтрокаXmlВход);
		ИначеЕсли ТипЗнч(СтрокаXmlВход) = Тип("ДвоичныеДанные") Тогда
			//ИмяФайлаЗип = ПолучитьИмяВременногоФайла("zip");
			//СтрокаXmlВход.Записать(ИмяФайлаЗип);
			//Архив = Новый ЧтениеZipФайла(ИмяФайлаЗип);
			////
			////// Сообщим комментарий к архиву.
			////Сообщить(Архив.Комментарий);
			//ИдентификаторАрхива = Строка(Новый УникальныйИдентификатор);
			//// Распакуем все файлы разом.
			//КаталогРаспаковки = КаталогВременныхФайлов() + "\" + ИдентификаторАрхива;
			//Архив.ИзвлечьВсе(КаталогРаспаковки,	РежимВосстановленияПутейФайловZIP.Восстанавливать);
			РезультатФункции = Неопределено;

			//
			//// Распакуем файлы по одиночке.    
			//Для Каждого Элемент Из Архив.Элементы Цикл
			//	Сообщить(Элемент.ПолноеИмя);
			//	Архив.Извлечь(
			//	Элемент, // элемент для извлечения
			//	"c:\zip_out",
			//	РежимВосстановленияПутейФайловZIP.Восстанавливать,
			//	"" // пароль
			//	);
			//КонецЦикла;    
		Иначе
			РезультатФункции = Неопределено;
		КонецЕсли;	
	Иначе
		ТекстСообщения = НСтр("ru = 'Не заданы исходные данные для загрузки сборника. Операция отменена.'");
		Сообщить(ТекстСообщения);
		РезультатФункции = Неопределено;
	КонецЕсли;
	Возврат РезультатФункции;	
КонецФункции		// ОткрытьПарсер()	

Функция ПреобразоватьСтрокуСложности(СтрокаВход)
	РезультатФункции = "";
	Если СтрокаВход = "ЧетыреОтвета" Тогда
		РезультатФункции = Перечисления.СложностиСборников.ЧетыреОтвета;
	ИначеЕсли СтрокаВход = "ШестьОтветов" Тогда
		РезультатФункции = Перечисления.СложностиСборников.ШестьОтветов;
	Иначе
		РезультатФункции = Перечисления.СложностиСборников.ПустаяСсылка();
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ПреобразоватьСтрокуСложности()

// Возвращает структуру с данными сборника из документа ДокументВход парсера.
Функция ПолучитьСтруктуруДанныеСборникаИзДокумента(ДокументВход) Экспорт
	РезультатФункции = Новый Структура;
	Для Каждого Элемент0 Из ДокументВход.ЭлементДокумента.ДочерниеУзлы Цикл
		Если Элемент0.ИмяУзла = "Наименование" Тогда
			РезультатФункции.Вставить("Наименование", Элемент0.ТекстовоеСодержимое);
		ИначеЕсли Элемент0.ИмяУзла = "Описание" Тогда	
			РезультатФункции.Вставить("Описание", Элемент0.ТекстовоеСодержимое);
		ИначеЕсли Элемент0.ИмяУзла = "Автор" Тогда	
			РезультатФункции.Вставить("Автор", Элемент0.ТекстовоеСодержимое);    
		ИначеЕсли Элемент0.ИмяУзла = "Версия" Тогда	
			РезультатФункции.Вставить("Версия", Элемент0.ТекстовоеСодержимое);
		ИначеЕсли Элемент0.ИмяУзла = "ИдентификаторСборника" Тогда	
			РезультатФункции.Вставить("ИдентификаторСборника", Элемент0.ТекстовоеСодержимое);
		ИначеЕсли Элемент0.ИмяУзла = "Сложность" Тогда	
			РезультатФункции.Вставить("Сложность", ПреобразоватьСтрокуСложности(Элемент0.ТекстовоеСодержимое));	
		ИначеЕсли Элемент0.ИмяУзла = "БратьОтветыИзТекущегоСборника" Тогда	
			НовоеЗначениеБратьОтветы = XMLЗначение(Тип("Булево"), Элемент0.ТекстовоеСодержимое);
			РезультатФункции.Вставить("БратьОтветыИзТекущегоСборника", НовоеЗначениеБратьОтветы);				
		ИначеЕсли Элемент0.ИмяУзла = "КартинкаСборника" Тогда	
			ПредставлениеКартинки = Элемент0.ТекстовоеСодержимое;	
			ХранилищеКартинки = XMLЗначение(Тип("ХранилищеЗначения"), ПредставлениеКартинки);
			Если ХранилищеКартинки <> Неопределено Тогда
				РезультатФункции.Вставить("КартинкаСборника", ХранилищеКартинки);
			Иначе
				Сообщить("Не удалось загрузить картинку для сборника");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат РезультатФункции;
КонецФункции		// ПолучитьСтруктуруДанныеСборникаИзДокумента()

// Возвращает ссылку на справочник Сборник с идетификатором ИдетификаторВход.
// Когда ссылку не удалось получить однозначно - создаёт новый элемент.
Функция ПолучитьЭлементСборника(ИдентификаторВход)
	РезультатФункции = Справочники.Сборники.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сборники.Ссылка,
		|	Сборники.ИдентификаторСборника
		|ИЗ
		|	Справочник.Сборники КАК Сборники
		|ГДЕ
		|	Сборники.ИдентификаторСборника = &ИдентификаторСборника
		|	И НЕ Сборники.ПометкаУдаления";
	Запрос.УстановитьПараметр("ИдентификаторСборника", ИдентификаторВход);
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	Если Выгрузка.Количество() = 1 Тогда
		Для Каждого ТекВыгрузка Из Выгрузка Цикл
			РезультатФункции = ТекВыгрузка.Ссылка;
		КонецЦикла;	
	Иначе
		НовыйСправочник = Справочники.Сборники.СоздатьЭлемент();
		НовыйСправочник.Записать();
		РезультатФункции = НовыйСправочник.Ссылка;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ПолучитьЭлементСборника()

// Загружает сборник из документа ДокументВход парсера. Возвращает ссылку на загруженный сборник.
Функция ЗагрузитьСборникИзДокумента(ДокументВход)
	РезультатФункции = Справочники.Сборники.ПустаяСсылка();
	СтруктураСборника = ПолучитьСтруктуруДанныеСборникаИзДокумента(ДокументВход);
	НовыйИдентификатор = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураСборника, "ИдентификаторСборника", Строка(Новый УникальныйИдентификатор));
	СборникСсылка = ПолучитьЭлементСборника(НовыйИдентификатор);
	СправочникСборник = СборникСсылка.ПолучитьОбъект();
	СправочникСборник.Наименование					 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураСборника, "Наименование", "");
	СправочникСборник.Описание						 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураСборника, "Описание", "");
	СправочникСборник.Автор							 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураСборника, "Автор", "");
	СправочникСборник.Версия						 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураСборника, "Версия", "");
	СправочникСборник.ИдентификаторСборника			 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураСборника, "ИдентификаторСборника", "");
	СправочникСборник.Сложность						 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураСборника, "Сложность", Перечисления.СложностиСборников.ШестьОтветов);
	СправочникСборник.КартинкаСборника				 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураСборника, "КартинкаСборника", Новый ХранилищеЗначения(Новый Картинка));
	СправочникСборник.БратьОтветыИзТекущегоСборника	 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураСборника, "БратьОтветыИзТекущегоСборника", Ложь);
	Попытка
		СправочникСборник.Записать();
		РезультатФункции = СправочникСборник.Ссылка;
	Исключение
		Сообщить("При записи сборника произошли ошибки: " + ОписаниеОшибки());
		Возврат Справочники.Сборники.ПустаяСсылка();
	КонецПопытки;
	Возврат РезультатФункции;
КонецФункции		// ЗагрузитьСборникИзДокумента()	

// Помечает на удаление все вопросы, принадлежащие сборнику СборникВход.
Процедура ПометитьНаУдалениеВопросыСборника(СборникВход)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задания.Ссылка,
		|	Задания.Владелец
		|ИЗ
		|	Справочник.Задания КАК Задания
		|ГДЕ
		|	НЕ Задания.ПометкаУдаления
		|	И Задания.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", СборникВход);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СправочникСсылка = ВыборкаДетальныеЗаписи.Ссылка;
		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		СправочникОбъект.ПометкаУдаления = Истина;
		СправочникОбъект.Записать();
	КонецЦикла;
КонецПроцедуры		// ПометитьНаУдалениеВопросыСборника()
	
// Загружает вопросы в сборник СборникВход из документа ДокументВход парсера.
Процедура ЗагрузитьВопросыИзДокумента(ДокументВход, СборникВход)
	ПометитьНаУдалениеВопросыСборника(СборникВход);
	Для Каждого Элемент0 Из ДокументВход.ЭлементДокумента.ДочерниеУзлы Цикл
		Если Элемент0.ИмяУзла = "Вопросы" Тогда
			Для Каждого Элемент1 Из Элемент0.ДочерниеУзлы Цикл
				Если Элемент1.ИмяУзла = "Вопрос" Тогда
					СправочникВопрос = Справочники.Задания.СоздатьЭлемент();
					СправочникВопрос.Владелец = СборникВход;
					Для Каждого Элемент2 Из Элемент1.ДочерниеУзлы Цикл
						Если Элемент2.ИмяУзла = "Наименование" Тогда
							СправочникВопрос.Наименование = Элемент2.ТекстовоеСодержимое;
						ИначеЕсли Элемент2.ИмяУзла = "ТекстВопроса" Тогда	
							СправочникВопрос.ТекстВопросаЗадания = Элемент2.ТекстовоеСодержимое;
						ИначеЕсли Элемент2.ИмяУзла = "КартинкаЗадания" Тогда	
							ПредставлениеКартинки = Элемент2.ТекстовоеСодержимое;
							ХранилищеКартинки = XMLЗначение(Тип("ХранилищеЗначения"), ПредставлениеКартинки);
							Если ХранилищеКартинки <> Неопределено Тогда
								СправочникВопрос.КартинкаЗадания = ХранилищеКартинки;
							Иначе
								Сообщить("Не удалось загрузить картинку для вопроса " + Строка(СправочникВопрос));
							КонецЕсли;
						ИначеЕсли Элемент2.ИмяУзла = "Ответы" Тогда	
							Для Каждого Элемент3 Из Элемент2.ДочерниеУзлы Цикл
								Если Элемент3.ИмяУзла = "Ответ" Тогда
									НоваяСтрокаОтвет = СправочникВопрос.ОтветыЗаданий.Добавить();
									Для Каждого Элемент4 Из Элемент3.ДочерниеУзлы Цикл
										Если Элемент4.ИмяУзла = "ТекстОтвета" Тогда	
											НоваяСтрокаОтвет.ТекстОтвета = Элемент4.ТекстовоеСодержимое;
										ИначеЕсли Элемент4.ИмяУзла = "Правильность" Тогда	
											НоваяПравильность = XMLЗначение(Тип("Булево"), Элемент4.ТекстовоеСодержимое);
											НоваяСтрокаОтвет.Правильность = НоваяПравильность;
										Иначе
											// Пропускаем.
										КонецЕсли;
									КонецЦикла;
								Иначе
									// Пропускаем.
								КонецЕсли;
							КонецЦикла;
						Иначе
							// Пропускаем.
						КонецЕсли;
					КонецЦикла;
					СправочникВопрос.Записать();
				Иначе
					// Пропускаем.
				КонецЕсли;
			КонецЦикла;
		Иначе
			// Пропускаем.
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры		// ЗагрузитьВопросыИзДокумента()

// Загружает сборник инициализированный из файла с путём ПутьКФайлуВход,
// либо строкой СтрокаXmlВход.
Функция ЗагрузитьСборник_Сервер(ПутьКФайлуВход = "", СтрокаXmlВход = "") Экспорт
	РезультатФункции = Ложь;
	ЕстьОшибки = Ложь;
	НачатьТранзакцию();
	Попытка
		Парсер = ОткрытьПарсер(ПутьКФайлуВход, СтрокаXmlВход);
		Если Парсер <> Неопределено Тогда
			Построитель = Новый ПостроительDOM;
			// Загрузим справочник Сборник.
			Документ = Построитель.Прочитать(Парсер);
			СправочникСборник = ЗагрузитьСборникИзДокумента(Документ);
			Парсер.Закрыть();	
			// Имея ссылку на владельца, загрузим вопросы.
			Парсер = ОткрытьПарсер(ПутьКФайлуВход, СтрокаXmlВход);
			ЗагрузитьВопросыИзДокумента(Документ, СправочникСборник);
			Парсер.Закрыть();
		Иначе
			// Данные не удалось получить.
		КонецЕсли;
	Исключение
		ЕстьОшибки = Истина;
		Сообщить("При загрузке сборника возникли ошибки: " + ОписаниеОшибки());
	КонецПопытки;
	// Фиксирование транзакции.
	Если ЕстьОшибки Тогда
		ОтменитьТранзакцию();
		РезультатФункции = Ложь;
	Иначе
		ЗафиксироватьТранзакцию();
		РезультатФункции = Истина;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ЗагрузитьСборник_Сервер()

// Возвращает структуру данных сборника СборникВход для выгрузки в файл.
Функция ПолучитьДанныеСборника(СборникВход)
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Наименование",					 СборникВход.Наименование);
	РезультатФункции.Вставить("Описание",						 СборникВход.Описание);
	РезультатФункции.Вставить("Автор",							 СборникВход.Автор);
	РезультатФункции.Вставить("Версия",							 СборникВход.Версия);
	РезультатФункции.Вставить("ИдентификаторСборника",			 СборникВход.ИдентификаторСборника);
	РезультатФункции.Вставить("Сложность",						 СборникВход.Сложность);
	РезультатФункции.Вставить("БратьОтветыИзТекущегоСборника",	 СборникВход.БратьОтветыИзТекущегоСборника);
	КартинкаСборника = Новый Картинка;
	КартинкаСборника = СборникВход.КартинкаСборника;
	РезультатФункции.Вставить("КартинкаСборника", КартинкаСборника);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаданияОтветыЗаданий.Ссылка.Наименование,
		|	ЗаданияОтветыЗаданий.Ссылка.ТекстВопросаЗадания,
		|	ЗаданияОтветыЗаданий.Ссылка.КартинкаЗадания,
		|	ЗаданияОтветыЗаданий.ТекстОтвета,
		|	ЗаданияОтветыЗаданий.Правильность,
		|	ЗаданияОтветыЗаданий.Ссылка.Код,
		|	ЗаданияОтветыЗаданий.Ссылка
		|ИЗ
		|	Справочник.Задания.ОтветыЗаданий КАК ЗаданияОтветыЗаданий
		|ГДЕ
		|	ЗаданияОтветыЗаданий.Ссылка.Владелец = &Владелец
		|	И НЕ ЗаданияОтветыЗаданий.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("Владелец", СборникВход);
	РезультатЗапроса = Запрос.Выполнить();
	ВыгрузкаЗадания = РезультатЗапроса.Выгрузить();
	КопияЗадания = ВыгрузкаЗадания.Скопировать();
	КопияЗадания.Свернуть("Ссылка");
	МассивЗаданий = Новый Массив;
	Для Каждого ТекКопияЗадания Из КопияЗадания Цикл
		МассивОтветов = Новый Массив;
		НаименованиеЗадания = "";
		ТекстВопросаЗадания = "";
		КартинкаЗадания = Новый Картинка;
		Для Каждого ТекВыгрузкаЗадания Из ВыгрузкаЗадания Цикл
			Если ТекВыгрузкаЗадания.Ссылка = ТекКопияЗадания.Ссылка Тогда
				СтруктураОтвета = Новый Структура;
				СтруктураОтвета.Вставить("ТекстОтвета", ТекВыгрузкаЗадания.ТекстОтвета);
				СтруктураОтвета.Вставить("Правильность", ТекВыгрузкаЗадания.Правильность);
				МассивОтветов.Добавить(СтруктураОтвета);
				НаименованиеЗадания = ТекВыгрузкаЗадания.Наименование;
				ТекстВопросаЗадания = ТекВыгрузкаЗадания.ТекстВопросаЗадания;
				КартинкаЗадания = ТекВыгрузкаЗадания.КартинкаЗадания;
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		СтруктураЗадания = Новый Структура;
		СтруктураЗадания.Вставить("Наименование", НаименованиеЗадания);
		СтруктураЗадания.Вставить("ТекстВопросаЗадания", ТекстВопросаЗадания);
		СтруктураЗадания.Вставить("КартинкаЗадания", КартинкаЗадания);
		СтруктураЗадания.Вставить("Ответы", МассивОтветов);
		МассивЗаданий.Добавить(СтруктураЗадания);
	КонецЦикла;
	РезультатФункции.Вставить("МассивЗаданий", МассивЗаданий);
	Возврат РезультатФункции;
КонецФункции

// Возвращает строковое представление сложности СложностьВход для выгрузки.
Функция ПреобразоватьСложностьКСтроке(СложностьВход)
	РезультатФункции = "";
	Если СложностьВход = Перечисления.СложностиСборников.ЧетыреОтвета Тогда
		РезультатФункции = "ЧетыреОтвета";
	ИначеЕсли СложностьВход = Перечисления.СложностиСборников.ШестьОтветов Тогда
		РезультатФункции = "ШестьОтветов";
	Иначе
		РезультатФункции = "";
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ПреобразоватьСложностьКСтроке()

// Выполняет выгрузку данных сборника СборникВход в файл с именем ИмяФайлаВход.
Процедура ВыгрузитьСборникВФайл(СборникВход, ИмяФайлаВход) Экспорт
	// Получение данных сборника.
	ДанныеСборника = ПолучитьДанныеСборника(СборникВход);
	// Открытие файла.
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяФайлаВход);
	ЗаписьXML.ЗаписатьОбъявлениеXML();    
	ЗаписьXML.ЗаписатьНачалоЭлемента("Сборник");
	// Запись данных шапки.
	ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
	ЗаписьXML.ЗаписатьТекст(ДанныеСборника.Наименование);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьНачалоЭлемента("Описание");
	ЗаписьXML.ЗаписатьТекст(ДанныеСборника.Описание);
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Автор");
	ЗаписьXML.ЗаписатьТекст(ДанныеСборника.Автор);
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Версия");
	ЗаписьXML.ЗаписатьТекст(ДанныеСборника.Версия);
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Сложность");
	ЗаписьXML.ЗаписатьТекст(ПреобразоватьСложностьКСтроке(ДанныеСборника.Сложность));
	ЗаписьXML.ЗаписатьКонецЭлемента(); 	
	ЗаписьXML.ЗаписатьНачалоЭлемента("КартинкаСборника");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(ДанныеСборника.КартинкаСборника));
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИдентификаторСборника");
	ЗаписьXML.ЗаписатьТекст(ДанныеСборника.ИдентификаторСборника);
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("БратьОтветыИзТекущегоСборника");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(ДанныеСборника.БратьОтветыИзТекущегоСборника));
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Вопросы");
	Для Каждого ТекМассивЗаданий Из ДанныеСборника.МассивЗаданий Цикл
		// Запись вопроса.
		ЗаписьXML.ЗаписатьНачалоЭлемента("Вопрос");
		ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
		ЗаписьXML.ЗаписатьТекст(ТекМассивЗаданий.Наименование);
		ЗаписьXML.ЗаписатьКонецЭлемента(); 
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТекстВопроса");
		ЗаписьXML.ЗаписатьТекст(ТекМассивЗаданий.ТекстВопросаЗадания);
		ЗаписьXML.ЗаписатьКонецЭлемента(); 
		ЗаписьXML.ЗаписатьНачалоЭлемента("КартинкаЗадания");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(ТекМассивЗаданий.КартинкаЗадания));
		ЗаписьXML.ЗаписатьКонецЭлемента(); 
		ЗаписьXML.ЗаписатьНачалоЭлемента("Ответы");
		Для Каждого ТекОтветы Из ТекМассивЗаданий.Ответы Цикл
			// Запись ответа.
			ЗаписьXML.ЗаписатьНачалоЭлемента("Ответ");
			ЗаписьXML.ЗаписатьНачалоЭлемента("ТекстОтвета");
			ЗаписьXML.ЗаписатьТекст(ТекОтветы.ТекстОтвета);
			ЗаписьXML.ЗаписатьКонецЭлемента(); 
			ЗаписьXML.ЗаписатьНачалоЭлемента("Правильность");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(ТекОтветы.Правильность));
			ЗаписьXML.ЗаписатьКонецЭлемента(); 
			ЗаписьXML.ЗаписатьКонецЭлемента(); 
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента(); 
		ЗаписьXML.ЗаписатьКонецЭлемента(); 
	КонецЦикла;	
	// Закрытие файла.
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	ЗаписьXML.Закрыть();
КонецПроцедуры		// ВыгрузитьСборникВФайл()
